/*
    Date 2 Mar 2026
*/

-- 1.3.0 - CREATE TABLE Player.NativeName
-- DEPENDENCIES: Player.Player
CREATE TABLE Player.NativeName
(
    PlayerId INT PRIMARY KEY NOT NULL,
    NativeFirstName NVARCHAR(30),
    NativeLastName NVARCHAR(30),

    FOREIGN KEY (PlayerId) REFERENCES Player.Player(Id),
)

INSERT INTO Player.NativeName (PlayerId, NativeFirstName, NativeLastName) VALUES
(55, 'سليم', 'ميكيل'),
(59, 'Іоанн', 'Сухарєв'),
(60, 'Данило', 'Тесленко'),
(61, 'Егор', 'Васильев'),
(62, 'Денис', 'Костин'),
(75, 'שושן', 'שחר'),
(79, 'Илья', 'Осипов'),
(80, 'Никола', 'Ковач'),
(81, 'Олександр', 'Костилєв'),
(82, 'Валерій', 'Ваховський'),
(83, 'Денис', 'Шарипов'),
(84, 'Кирилл', 'Михайлов'),
(85, 'Илья', 'Залуцкий'),
(86, 'Віктор', 'Оруджев'),
(87, 'Немања', 'Ковач'),
(91, 'Немања', 'Исаковић'),
(120, 'Дмитрий', 'Соколов'),
(121, 'Сергей', 'Рыхторов'),
(122, 'Владислав', 'Горшков'),
(123, 'Тимофей', 'Якушин'),
(124, 'Абай', 'Хасенов'),
(126, 'Джами', 'Али'),
(127, 'Алексей', 'Голубев'),
(128, 'Тимур', 'Тулепов'),
(129, 'Санжар', 'Кулиев'),
(130, 'Евгений', 'Лебедев'),
(131, 'Пётр', 'Болышев'),
(132, 'Давид', 'Даниелян'),
(141, 'Валентин', 'Василев'),
(143, 'Цветелин', 'Димитров'),
(152, 'ברמן', 'דוריאן'),
(154, 'גלעדי', 'לוטן'),
(155, 'Ігор', 'Жданов'),
(159, 'Данил', 'Крышковец'),
(160, 'Борис', 'Воробьев'),
(161, 'Мирослав', 'Плахотя')